data_generation/Case4/constant/cx
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "constant";
    object      cx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
134648
(
-1.64973
-1.64973
-1.64973
-1.64973
-1.64973
-1.64973
-1.64973
-1.64973
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
78
(
-1.651
-1.651
-1.651
-1.651
-1.651
-1.651
-1.651
-1.651
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
140
(
0.635
0.635
0.635
0.635
0.635
0.635
0.635
0.635
...
)
;
    }
    lowerWallStartup
    {
        type            symmetryPlane;
    }
    upperWallStartup
    {
        type            symmetryPlane;
    }
    upperWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
1356
(
0.000271773
0.000815319
0.00135887
0.00190241
0.00244596
0.0029895
0.00353305
0.0040766
...
)
;
    }
    lowerWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
1418
(
-0.000317644
-0.000953366
-0.00158996
-0.00222742
-0.00286575
-0.00350495
-0.00414503
-0.00478598
...
)
;
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
}


// ************************************************************************* //
