data_generation/Case4/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "0";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
267700
(
-1.24403e-12
3.66264e-05
-8.61783e-12
4.02891e-05
-1.67018e-11
4.4318e-05
-2.55413e-11
4.87498e-05
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
78
(
-3.66264e-05
-4.02891e-05
-4.4318e-05
-4.87498e-05
-5.36248e-05
-5.89872e-05
-6.4886e-05
-7.13746e-05
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
140
(
9.80327e-05
9.99934e-05
0.000101993
0.000104033
0.000106114
0.000108236
0.000110401
0.000112609
...
)
;
    }
    lowerWallStartup
    {
        type            symmetryPlane;
        value           uniform 0;
    }
    upperWallStartup
    {
        type            symmetryPlane;
        value           uniform 0;
    }
    upperWall
    {
        type            calculated;
        value           uniform 0;
    }
    lowerWall
    {
        type            calculated;
        value           uniform 0;
    }
    back
    {
        type            empty;
        value           nonuniform 0();
    }
    front
    {
        type            empty;
        value           nonuniform 0();
    }
}


// ************************************************************************* //
