data_generation/Case4/system/stressComponents
type            turbulenceFields;
libs            ("libfieldFunctionObjects.so");
writeControl    writeTime;
fields         (R devReff nuEff);
